In [1]:
import glob
glob.glob('*.csv')

['bank-additional.csv', 'bank-additional-full.csv']

In [38]:
pwd()

u'/home/vijayprakash/Downloads/bank-additional'

In [2]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split

In [3]:
data = pd.read_csv('bank-additional.csv')

In [4]:
data.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,y
0,30,blue-collar,married,basic.9y,no,yes,no,cellular,may,fri,487,2,999,0,nonexistent,no
1,39,services,single,high.school,no,no,no,telephone,may,fri,346,4,999,0,nonexistent,no
2,25,services,married,high.school,no,yes,no,telephone,jun,wed,227,1,999,0,nonexistent,no
3,38,services,married,basic.9y,no,unknown,unknown,telephone,jun,fri,17,3,999,0,nonexistent,no
4,47,admin.,married,university.degree,no,yes,no,cellular,nov,mon,58,1,999,0,nonexistent,no

In [7]:
data.shape

(4119, 16)

In [16]:
data_train, data_test = train_test_split(data, test_size=0.3, random_state=0)

In [17]:
data_train.shape

(2883, 16)

In [18]:
data_test.shape

(1236, 16)

In [19]:
data_test.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,y
3754,46,blue-collar,married,basic.4y,unknown,no,yes,telephone,jun,thu,89,1,999,0,nonexistent,no
45,39,management,single,university.degree,unknown,no,no,cellular,may,thu,412,2,999,0,nonexistent,no
2774,34,unemployed,single,university.degree,no,no,no,telephone,jun,mon,409,4,999,0,nonexistent,no
1170,24,admin.,single,high.school,unknown,yes,no,cellular,jul,thu,470,1,999,0,nonexistent,no
4042,40,blue-collar,single,basic.9y,no,unknown,unknown,cellular,nov,wed,245,4,999,0,nonexistent,no

In [20]:
data_test = data_test.drop("y",axis=1)

In [22]:
data_test.shape

(1236, 15)

In [24]:
data_train.to_csv('bankTerm_train.csv')

In [25]:
data_test.to_csv('bankTerm_test.csv')

-----------------------------------------Dataset 2----------------------------------------------------------------------

https://www.kaggle.com/wcj365/rmudsc2

In [60]:
glob.glob('*.csv')

['bankTerm_test.csv',
 'nyc-rolling-sales.csv',
 'sales_test.csv',
 'book_train.csv',
 'toy_test.csv',
 'bankTerm_train.csv',
 'DialysisCareQualityData.csv',
 'book_test.csv',
 'nyc-jobs.csv',
 'bank-additional.csv',
 'toy_train.csv',
 'bank-additional-full.csv',
 'toy_dataset.csv',
 'books.csv',
 'sales_train.csv',
 'diabetic_data.csv']

In [62]:
SRR = pd.read_csv('DialysisCareQualityData.csv')

In [63]:
SRR.head()

,Unnamed: 0,CCN,AverageAge,PctgAge18,PctgAge18t64,PctgAge64,PctgBlack,PctgHispanic,PctgFemale,Network,...,UnemploymentRate,PctgFamilyBelowFPL,PctgPoorEnglish,HospitalAffiliation,State,Region,Division,Urbanicity,Urbanicity2,YearsInOps
0,0,12500,57.896226,0.0,69.811321,30.188679,89.622642,0.943396,62.264151,8,...,5.7,42.6,0.2,Non-Hospital Facilities,Alabama,South,East South Central,Metropolitan,Urban,40.332108
1,1,12501,59.560976,0.0,73.170732,26.829268,60.975610,2.439024,48.780488,8,...,3.3,17.0,3.1,Non-Hospital Facilities,Alabama,South,East South Central,Metropolitan,Urban,40.332108
2,2,12502,58.881188,0.0,68.316832,31.683168,83.168317,1.980198,45.544554,8,...,6.3,23.8,2.7,Non-Hospital Facilities,Alabama,South,East South Central,Metropolitan,Urban,39.195877
3,3,12505,58.311688,0.0,67.532468,32.467532,87.012987,1.298701,46.753247,8,...,1.5,14.4,3.6,Non-Hospital Facilities,Alabama,South,East South Central,Metropolitan,Urban,39.048030
4,4,12506,60.338235,0.0,57.352941,42.647059,44.117647,2.941176,47.058824,8,...,3.2,7.1,1.7,Non-Hospital Facilities,Alabama,South,East South Central,Metropolitan,Urban,39.091836

In [64]:
SRR.shape

(6574, 59)

In [65]:
data_train, data_test = train_test_split(SRR, test_size=0.3, random_state=0)

In [66]:
data_test = data_test.drop("SRR",axis=1)

In [67]:
data_train.to_csv('SRR_train.csv')

In [68]:
data_test.to_csv('SRR_test.csv')

---------------------------------dataset 3-----------------------------------------------------------------------------

https://www.kaggle.com/jealousleopard/goodreadsbooks

In [59]:
glob.glob('*.csv')

['bankTerm_test.csv',
 'nyc-rolling-sales.csv',
 'sales_test.csv',
 'book_train.csv',
 'toy_test.csv',
 'bankTerm_train.csv',
 'DialysisCareQualityData.csv',
 'book_test.csv',
 'nyc-jobs.csv',
 'bank-additional.csv',
 'toy_train.csv',
 'bank-additional-full.csv',
 'toy_dataset.csv',
 'books.csv',
 'sales_train.csv',
 'diabetic_data.csv']

In [34]:
books = pd.read_csv('books.csv', error_bad_lines=False)

Skipping line 4012: expected 10 fields, saw 11
Skipping line 5688: expected 10 fields, saw 11
Skipping line 7056: expected 10 fields, saw 11
Skipping line 10601: expected 10 fields, saw 11
Skipping line 10668: expected 10 fields, saw 11

In [35]:
books.head()

,bookID,title,authors,average_rating,isbn,isbn13,language_code,# num_pages,ratings_count,text_reviews_count
0,1,Harry Potter and the Half-Blood Prince (Harry ...,J.K. Rowling-Mary GrandPré,4.56,0439785960,9780439785969,eng,652,1944099,26249
1,2,Harry Potter and the Order of the Phoenix (Har...,J.K. Rowling-Mary GrandPré,4.49,0439358078,9780439358071,eng,870,1996446,27613
2,3,Harry Potter and the Sorcerer's Stone (Harry P...,J.K. Rowling-Mary GrandPré,4.47,0439554934,9780439554930,eng,320,5629932,70390
3,4,Harry Potter and the Chamber of Secrets (Harry...,J.K. Rowling,4.41,0439554896,9780439554893,eng,352,6267,272
4,5,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling-Mary GrandPré,4.55,043965548X,9780439655484,eng,435,2149872,33964

In [36]:
books.shape

(13714, 10)

In [37]:
data_train, data_test = train_test_split(books, test_size=0.3, random_state=0)

In [39]:
data_train.head()

,bookID,title,authors,average_rating,isbn,isbn13,language_code,# num_pages,ratings_count,text_reviews_count
8775,28247,Voice of the Gods (Age of the Five #3),Trudi Canavan,4.08,0060815922,9780060815929,en-US,592,9413,132
10629,34658,Shattered Sword: The Untold Story of the Battl...,Jonathan Parshall-Anthony Tully,4.40,1574889230,9781574889239,eng,612,1696,141
520,1506,CliffsNotes on Euripides' Medea and Electra,Robert J. Milch,4.20,0822004240,9780822004240,eng,69,5,0
2275,6919,Baby's Alphabet,Jean Marzollo-Nancy Sheehan,3.75,0761316434,9780761316435,eng,32,4,0
7516,23589,The J.R.R. Tolkien Companion and Guide,Christina Scull-Wayne G. Hammond,4.60,0618391134,9780618391134,eng,2264,45,0

In [40]:
data_test.head()

,bookID,title,authors,average_rating,isbn,isbn13,language_code,# num_pages,ratings_count,text_reviews_count
8900,28566,The Empty Chair (Lincoln Rhyme #3),Jeffery Deaver,4.07,0671026011,9780671026011,en-US,512,448,41
11313,37817,The Blazing Center Study Guide: The Soul-Satis...,John Piper,4.28,1590526856,9781590526859,eng,112,18,0
2879,8875,Planet of the Apes,Pierre Boulle-Xan Fielding,3.93,0517209489,9780517209486,en-US,192,86,14
6511,19482,The New York Trilogy: City Of Glass Ghosts T...,Paul Auster,3.90,0571149251,9780571149254,eng,314,18,2
577,1625,Twelfth Night,William Shakespeare,3.98,0743482778,9780743482776,eng,220,133832,2321

In [41]:
data_test = data_test.drop("average_rating",axis=1)

In [42]:
data_train.to_csv('book_train.csv')

In [43]:
data_test.to_csv('book_test.csv')

------------------------------------------data 4-----------------

In [45]:
toy = pd.read_csv('toy_dataset.csv')

In [46]:
toy.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [47]:
toy.shape

(150000, 6)

In [48]:
data_train, data_test = train_test_split(toy, test_size=0.3, random_state=0)

In [49]:
data_test = data_test.drop("Illness",axis=1)

In [50]:
data_train.to_csv('toy_train.csv')

In [51]:
data_test.to_csv('toy_test.csv')

-------------------------------------------dataset 5------------------------------

In [53]:
sales = pd.read_csv('nyc-rolling-sales.csv')

In [54]:
sales.head()

,Unnamed: 0,BOROUGH,NEIGHBORHOOD,BUILDING CLASS CATEGORY,TAX CLASS AT PRESENT,BLOCK,LOT,EASE-MENT,BUILDING CLASS AT PRESENT,ADDRESS,...,RESIDENTIAL UNITS,COMMERCIAL UNITS,TOTAL UNITS,LAND SQUARE FEET,GROSS SQUARE FEET,YEAR BUILT,TAX CLASS AT TIME OF SALE,BUILDING CLASS AT TIME OF SALE,SALE PRICE,SALE DATE
0,4,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,,C2,153 AVENUE B,...,5,0,5,1633,6440,1900,2,C2,6625000,2017-07-19 00:00:00
1,5,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,26,,C7,234 EAST 4TH STREET,...,28,3,31,4616,18690,1900,2,C7,-,2016-12-14 00:00:00
2,6,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,39,,C7,197 EAST 3RD STREET,...,16,1,17,2212,7803,1900,2,C7,-,2016-12-09 00:00:00
3,7,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21,,C4,154 EAST 7TH STREET,...,10,0,10,2272,6794,1913,2,C4,3936272,2016-09-23 00:00:00
4,8,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55,,C2,301 EAST 10TH STREET,...,6,0,6,2369,4615,1900,2,C2,8000000,2016-11-17 00:00:00

In [55]:
data_train, data_test = train_test_split(sales, test_size=0.3, random_state=0)

In [56]:
data_test = data_test.drop("SALE PRICE",axis=1)

In [57]:
data_train.to_csv('sales_train.csv')

In [58]:
data_test.to_csv('sales_test.csv')